package level_2.lecture_5.task_1;
/*
В методе main объяви переменные word, phrase, line и text типа String.
Присвой им разные значения. Используй одну команду для создания и инициализации переменных.
Значениями могут быть любые строки.

Требования:
В методе main объяви четыре переменные типа String.
Назови переменные именами word, phrase, line и text.
Переменным сразу присвой значения.
У всех переменных должны быть разные значения.
 */
public class Solution_1 {
    public static void main(String[] args) {
        String word = "telephone", phrase = "I have a phone", line = "forward", text = "I'm making it difficult"; //Фраза должна быть фразой, или это м.б. просто слово? А линия, какая??? Прямая, косая?:D Я написала передняя, типо форд, а не бек :) И текст, это должно быть целое предложение или тоже просто любое слово? Но, скорее всего, это задание на понимание, а я прикопалась к тому, что типо "должно" быть написано, когда ты наверное срать на это хотел))

        // 1 - у тебя есть ограничитель строк, строка кода должна влазить в этот ограничитель, как и комментарии
        // Вот это вертикальная линия --------------------------------------------------------------------------------->
        // Тобишь твой комментарий должен быть таким:

        //Фраза должна быть фразой, или это м.б. просто слово? А линия, какая??? Прямая, косая?:D Я написала передняя,
        // типо форд, а не бек :) И текст, это должно быть целое предложение или тоже просто любое слово?
        // Но, скорее всего, это задание на понимание, а я прикопалась к тому, что типо "должно" быть написано,
        // когда ты наверное срать на это хотел))

        //2 - В задаче не сказано, какие именно значения должны быть у переменных, лишь бы были индивидуальными,
        // Ты все правильно сделала

        //Океюшки, все понятно.


        /**
         * DONE
         */
    }
}